# Написать программу, которая будет запрашивать у пользователя две строки с помощью инпутов, а затем производить их конкатенацию.

# Запрос двух строк
string1 = input("Введите первую строку: ")
string2 = input("Введите вторую строку: ")

# Конкатенация строк
result = string1 + " " + string2

# Вывод результата
print(f"\nРезультат конкатенации: {result}")