# Напишите программу с помощью цикла for, которая суммирует все числа в списке.

numbers = [1, 2, 3, 4, 5]
sum = 0
for i in numbers:
    sum += i

print("Сумма чисел в списке:", sum)