# Создайте два множества, объедините их и выведите результат

my_set1 = {1, 2, 3, 4, 5}
my_set2 = {6, 7, 8, 9, 10}

set_union = my_set1.union(my_set2)

print("Объединение:", set_union)