# Создайте два множества, найдите пересечение и выведите результат

my_set1 = {1, 2, 3, 4, 5}
my_set2 = {4, 5, 6, 7, 8}

set_intersection = my_set1.intersection(my_set2)

print("Пересечение:", set_intersection)
